<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
data.github_team.test_team_access: Reading...
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice.module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.ministryofjustice.module.github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:.github]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.github.github_repository.default: Refreshing state... [id=.github]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default: Refreshing state... [id=operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Refreshing state... [id=operations-engineering-find-a-github-repository-owner]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default: Refreshing state... [id=operations-engineering-dns-issues]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default: Refreshing state... [id=operations-engineering-octodns-poc]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
data.github_team.operations_engineering: Read complete after 5s [id=4192115]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMRCOOM4DF_rj]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMDCRNs4DB666]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4DIuFD]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_branch_protection.default: Refreshing state... [id=BPR_kwDOManiY84DIuFG]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice.module.operations-engineering-dns-issues.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMIbLL84DDdaX]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-octodns-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMK6SNs4DEK2K]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9|AWSCURRENT]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-dns-issues.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.test_tamf_repo_2.github_actions_secret.default["EXAMPLE_SECRET"]: Refreshing state... [id=test-tamf-repo-2:EXAMPLE_SECRET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.acronyms.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"97d675e503e7c968d98b43637fe1cb74cf8c064ac2bdb7dd81d5e9617257e454\"" -> "W/\"e318dcc56fdb93a5ce16abd4c5988ec3583cd4a40cd7887e2aeb470dcf981d02\""
        id                          = "acronyms"
        name                        = "acronyms"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"76569f5511c73017760eda1d829cbc55affd33c738facf19b3f50e769ffd43c7\"" -> "W/\"8f57cb2437bb3a6bd8946203b733d754b28f6fba003d33a47e383d4226b6a29d\""
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-actions.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"090f5966e453d1d8d67541a459d2ddc9800dfa383b606c21b81208540f2cd3a9\"" -> "W/\"49f6baa881d4736b1e89b7edf1e51fc1ce54dff7838ca3682b9e8829e5c20b11\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-collaborators.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2270dd05f5eda36ae9f4ffc60349f541a3a94ea76f62ba2cf06a4a2678407ded\"" -> "W/\"44c0c02998c1520bc4fabd853748f56e2041a2ed39b607f05f44bfa1ff605b4d\""
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"28f68ff4b7b133d1391143ff02384e56d15a3ddd9ef1a0d9abdf768d004b60c2\"" -> "W/\"14a06ad4bf686ae3f53d014a8d195dac710ef86c6b2508ca6c6d53fdface65d8\""
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"e2e14fdd43a6cc5063313c7614a99a082b4de4a09345d4aea3ffda6eb0b73c5b\"" -> "W/\"59e742a193e4f6ff04e021a3a2a00c221ca53eb573bd19dea53baa6cc3ead8c2\""
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"909fb5ae66b644efd21b5d2aa2aa0e83d36f3324a7172abf365f0462fd80a58d\"" -> "W/\"94e26692b3794d462a698addc27e2314db4a788d15130691796e9228c9cfe289\""
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"708e9c530541a517879230433dcc4fdf23cca5b7d38a134c23b93077b86c907a\"" -> "W/\"3aefb7d9acd484958f1fe8f7bac1119d3a40bfc209866742955646b226f6d9e2\""
        id                          = "operations-engineering-devcontainer"
        name                        = "operations-engineering-devcontainer"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"73100f71ae3b62c0fc16dadc1f9352567ed87ad0fdefbe61ae58dd844deb1e3c\"" -> "W/\"9ec8590066225a169d4388e81760403fe6e09f8ca5b229bc3ac141a8a5d2b7ef\""
        id                          = "operations-engineering-dns-form"
        name                        = "operations-engineering-dns-form"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c917aa36acbdd4484b9a7ae56c00d48f1b47d1d29b145c6b1c6a2b79133c1693\"" -> "W/\"0a90557acb4f09fe3574d4f7c1783d85383d0b8d609bdc6de13a492b7ac742f1\""
        id                          = "operations-engineering-dns-issues"
        name                        = "operations-engineering-dns-issues"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"be4852bceb04a2988f9c0a4ee2ab42a43f1344d85dc87cc631bde7500e57f7fa\"" -> "W/\"bf58e9aa9ec70cded226c04eb7b914935ebabe20f18a6801805f87d6988c33fc\""
        id                          = "operations-engineering-dns-spike"
        name                        = "operations-engineering-dns-spike"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"098380cb7dce7b8f557f030c91d8d34db0779dfa390d0c94a5fef47823de68df\"" -> "W/\"e2b940db42f742aa4ceaa41bb0fc95af3328ea3566ebddf5c191e1541faeb203\""
        id                          = "operations-engineering-documentation-browser-extension"
        name                        = "operations-engineering-documentation-browser-extension"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-example.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"c37c50b39bb4df68f940a117cbb574dd3485bb2229546349615b9ca8444dd0be\"" -> "W/\"e25186250598f2c406fd0bc20ecac3fd4d3e59cd5861ef7e93cf4b0d7814893f\""
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2a15e052f1cb77b603c6740347adfd65ef17ccdfed95fa685ce62795ab8be995\"" -> "W/\"4f6d66755792e17af79a475647579020d5b76e2f2b1419059adf640fec162302\""
        id                          = "operations-engineering-find-a-github-repository-owner"
        name                        = "operations-engineering-find-a-github-repository-owner"
      ~ primary_language            = "HTML" -> "Python"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"e8b61893fe10f551168d03a26cbf6d057168e9aee0cee14f02706550448c3e01\"" -> "W/\"2e2243198658504caa6e4025a399220228e896b9060a3bb620ecaa664f52a477\""
        id                          = "operations-engineering-github-actions-dashboard"
        name                        = "operations-engineering-github-actions-dashboard"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-join-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4d07d487087c322688dabfa58502b03319f2e49e08cd584ba683433c68192067\"" -> "W/\"f050ed2d2c15cca54515dcb2631dc0f243d45686975a916ccfd5e9668769e2d2\""
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"df8337b79c4d5653a9d7829a69c8cf32284e0ccfc719757572af1eeb14376672\"" -> "W/\"46c56d1ca2aa5b2e18089897604f74c4d0bd8c6222fd72ace066a5f889c9130c\""
        id                          = "operations-engineering-kpi-dashboard"
        name                        = "operations-engineering-kpi-dashboard"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8f12808c6040830b328f86048cb3a480e4fd25a06c397a9af028c5dc15b8fa0e\"" -> "W/\"afd3a6d01b11b76595690181a035db01d30190f91a09653c820a2ccc82880fd7\""
        id                          = "operations-engineering-metadata-poc"
        name                        = "operations-engineering-metadata-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"b0367a2ab86cde040b65f1a335d02853dae13fc974a005fa388231e614c389b6\"" -> "W/\"795180c8cbd4d5ea859b6c8d16c36c85fa6ace3e07b374609f115c3a1f9a7c8f\""
        id                          = "operations-engineering-octodns-poc"
        name                        = "operations-engineering-octodns-poc"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-reports.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"e1fff93308703f8335f3b51081a964aaab968fbca19ebe51cc5da1015c5be975\"" -> "W/\"79b7a1010a492eb188e3ce98bb996450bb7c61d5ea9aae5914e65980aefbe1c5\""
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"a340279764f11ea3f9cd19f8e043f19c82ef48da9b03f08703703c909c89a639\"" -> "W/\"019df425adbe31251528483f2a518b1d1554994f89b1812b1db8f0115857812d\""
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2e40a9ccf43cb75c35f87629121057c1496384688c3c114af69cf8130cb64e40\"" -> "W/\"05b944e4735734bb4dc9184dc5558aee43eaefefc69d98255ada1313cc53a3fb\""
        id                          = "operations-engineering-support-metadata"
        name                        = "operations-engineering-support-metadata"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"72dd07c8812403d14c0c03af7da71ab2d8f25b051ad0c055de73d99e26ef5517\"" -> "W/\"b23e0ed0dad38e38b63d0136015e9c226b61c714a2548700ba1c39ea4519ef6d\""
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4df33f709b6f8cac52c01965cd64a76278b423c4bd53cb6e43c69093ee57c780\"" -> "W/\"fb1ec3b1d124099abb5f439665e0e09e0e37f9074514c2009620f66ab0948a25\""
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-monitor.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2b909ce183bdceb130f238a3ee33ae24454dc4fdf5b648431eafd9adbe28c94e\"" -> "W/\"5e4f57e66c5650bb173067b46266e5488e19693c677a2215dac5c3af73d85a09\""
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.technical-guidance.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4b589b99b5a8d868ce4397b7be19ec682b48f50d7028ae6b18d71d761b837eed\"" -> "W/\"b554ef961825b4bb88d20612978ac00b61d0b0629a7fe8d414bef1964dc113df\""
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-documentation-site.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"3e4d440dd5dab47da74567fdd305298d906f40d320da9f76a70ef5c5a2fd6912\"" -> "W/\"368541db6086c2f97c51602fe60eaaf6f25648202704f160aa72d80a82c8ae51\""
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"ed68163cbeb1a6c76af627ae1259182a55ab6f0b1daeef87935dc4a1e1850b17\"" -> "W/\"99d82c7fa589672edbbc30473b58acfe916adda21e1143ec2652f4275a456dd6\""
        id                          = "template-repository"
        name                        = "template-repository"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2fa5f16a98ab2677509e217d667ae1d613e233a8192ddf447c5e36d09c96aaaf\"" -> "W/\"101e85d9c8dc5399c6bc7ff6a687e6a4a2624088f69bb9987e29fec94f09ac94\""
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"d01e581550e61e87dda26940a855cba0a714d238d7550ff63c534e5472c8082e\"" -> "W/\"4247034be369d025b9cf552c340f5e9180a40ea5e0323e1da4bbc2a32e96e844\""
        id                          = "test-tamf-repo-2"
        name                        = "test-tamf-repo-2"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test-repo-levg.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"6e53b72a44bf91e273b9c9f51bd6a619fd29d6072ca6ef9c798b6de66b61fad7\"" -> "W/\"d2bf38bb600be17a9a69c50fd09806931cb90ec95a86e3adccc11e0226a847e5\""
        id                          = "test-repo-levg"
        name                        = "test-repo-levg"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"97d0e423103d38bb21b7178611d3ca5e25418339baf68a8330fad0b8150dd61d\"" -> "W/\"8ee696b56748824d8c258a4244f414af9b9963e4b39e6f8d359e603ad80219e9\""
        id                          = "test-tamf-repo-test-org"
        name                        = "test-tamf-repo-test-org"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.github.github_branch_protection.default will be destroyed
  # (because github_branch_protection.default is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOFbeyoM4CwGtg" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = ".github" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = true -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [] -> null
          - strict   = false -> null
        }
    }

  # module.ministryofjustice.module.github.github_repository.default will be destroyed
  # (because github_repository.default is not in configuration)
  - resource "github_repository" "default" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = true -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Default organisational policies for the Ministry of Justice • This repository is defined and managed in Terraform" -> null
      - etag                        = "W/\"696574ae65f3fba587b68d216d25fe1b838ff5b7299f3d78fe2243de355bb73f\"" -> null
      - full_name                   = "ministryofjustice/.github" -> null
      - git_clone_url               = "git://github.com/ministryofjustice/.github.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
      - html_url                    = "https://github.com/ministryofjustice/.github" -> null
      - http_clone_url              = "https://github.com/ministryofjustice/.github.git" -> null
      - id                          = ".github" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = ".github" -> null
      - node_id                     = "MDEwOlJlcG9zaXRvcnkzNjQzNjAzNTI=" -> null
      - private                     = false -> null
      - repo_id                     = 364360352 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:ministryofjustice/.github.git" -> null
      - svn_url                     = "https://github.com/ministryofjustice/.github" -> null
      - topics                      = [
          - "operations-engineering",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.ministryofjustice.module.github.github_team_repository.admin["4192115"] will be destroyed
  # (because github_team_repository.admin is not in configuration)
  - resource "github_team_repository" "admin" {
      - etag       = "W/\"7280f90a64d62ee79cc994b7dffc82722b102136b7377137948081e79234314a\"" -> null
      - id         = "4192115:.github" -> null
      - permission = "admin" -> null
      - repository = ".github" -> null
      - team_id    = "4192115" -> null
    }

  # module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "moj-terraform-scim-github"
      + team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CLI tool to automatically generate Python unit tests (unittest framework). This project is in POC. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-unit-test-generator-poc"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-unit-test-generator-poc"
      + team_id    = "4192115"
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```